// ConsoleApplication6.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main() {
    setlocale(LC_ALL, "RUS");
    // Входные данные
    double v1, t1, v2, t2, v3, t3;

    std::cout << "Введите скорость v1 (км/ч) и время t1 (часов) для первого этапа: ";
    std::cin >> v1 >> t1;

    std::cout << "Введите скорость v2 (км/ч) и время t2 (часов) для второго этапа: ";
    std::cin >> v2 >> t2;

    std::cout << "Введите скорость v3 (км/ч) и время t3 (часов) для третьего этапа: ";
    std::cin >> v3 >> t3;

    // Рассчитываем пройденные расстояния на каждом этапе
    double d1 = v1 * t1;
    double d2 = v2 * t2;
    double d3 = v3 * t3;

    // Общее пройденное расстояние
    double D = d1 + d2 + d3;

    // Рассчитываем время для привала
    double halfway_distance = D / 2.0;
    double time_for_halfway = 0.0;

    if (halfway_distance <= d1) {
        time_for_halfway = halfway_distance / v1;
    }
    else if (halfway_distance <= d1 + d2) {
        time_for_halfway = t1 + (halfway_distance - d1) / v2;
    }
    else {
        time_for_halfway = t1 + t2 + (halfway_distance - d1 - d2) / v3;
    }

    // Выводим результат
    std::cout << "Время для пройденной половины пути и привала: " << time_for_halfway << " часов." << std::endl;

    return 0;
}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.