// ConsoleApplication2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>


int main() {

    setlocale(LC_ALL, "RUS");
    // Заданные данные
    double distance = 15.0; // расстояние в километрах
    double timeInMinutes = 10.0; // время в минутах

    // Переводим время из минут в часы
    double timeInHours = timeInMinutes / 60.0;

    // Вычисляем скорость в м/с
    double speedInMetersPerSecond = distance / (timeInHours * 3600.0);

    // Вычисляем скорость в км/ч
    double speedInKilometersPerHour = distance / timeInHours;

    // Выводим результат
    std::cout << "Скорость поезда: " << speedInMetersPerSecond << " м/с" << std::endl;
    std::cout << "Скорость поезда: " << speedInKilometersPerHour << " км/ч" << std::endl;

    return 0;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
